Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/security_and_emergency_services/defence_forces.html.txt.tmx
Source language: en
Languages: ga

source: The roles of the Defence Forces are set out in the White Paper on Defence (pdf), published in August 2015
ga: Leagtar amach róil Óglaigh na hÉireann sa Pháipéar Bán um Chosaint (pdf), a foilsíodh i mí Lúnasa 2015

source: • To provide for the military defence of the State from armed aggression
ga: • Chun foráil do chosaint mhíleata an Stáit ó ionsaí faoi airm

source: • To participate in multi-national peace support, crisis management and humanitarian relief operations
ga: • Chun bheith rannpháirteach sa tacaíocht ilnáisiúnta don tsíocháin, sa bhainistiú géarchéime agus in oibríochtaí fóirithinte daonnachtúla

source: • To aid the civil power – meaning in practice to assist, when requested, the Garda Síochána
ga: • Chun cabhrú leis an gcumhacht shibhialta – a chiallaíonn sa ghnáthchleachtadh go dtugtar cúnamh don Gharda Síochána nuair a iarrtar amhlaidh

source: • To provide a fishery protection service
ga: • Chun seirbhís cosanta iascaigh a sholáthar

source: • To carry out any other duties that may be assigned to them from time to time, for example, search and rescue, air ambulance service, providing assistance in major emergencies
ga: • Chun cibé dualgas ar bith eile a dhéanamh agus a shanntar dóibh ó thráth go chéile, mar shampla, cuardach agus tarrtháil, seirbhís aerárthaigh othar, cúnamh a sholáthar ag mór-éigeandálaí

source: The Defence Forces Headquarters and the Department of Defence are located in the same building in Newbridge, Kildare
ga: Tá Ceanncheathrú Óglaigh na hÉireann agus An Roinn Cosanta suite san fhoirgneamh céanna sa Droichead Nua, Cill Dara

source: The Defence Forces Chief of Staff liaises with the Minister for Defence on all defence-related matters
ga: Bíonn idirchaidreamh idir Ceann Foirne Óglaigh na hÉireann agus an tAire Cosanta i leith gach ábhar a bhaineann leis an gcosaint

source: The Defence Forces consist of a Permanent Defence Force and a Reserve Defence Force
ga: Is iad na Buan-Óglaigh agus na hÓglaigh Chúltaca na fórsaí a fhaightear in Óglaigh na hÉireann

source: The main role of the Reserve Defence Force is to increase the capacity of the Permanent Defence Force to carry out its roles in crisis situations
ga: Is é príomhról na nÓglach Cúltaca ná chun cumas na mBuan-Óglach a mhéadú chun a róil a chur i gcrích i gcúinsí géarchéime

source: The President is the Commander and Chief of the Defence Forces
ga: Is é an tUachtarán Ceannasaí agus Ceann Óglaigh na hÉireann

source: The Permanent Defence Force has an establishment of at least 9,500 personnel and consists of 3 services:
ga: Tá líon pearsanra 9,500 duine ar a laghad ag na Buan-Óglaigh, agus is iontu a fhaightear 3 sheirbhís:

source: The Army consists of 2 brigades
ga: Tá 2 bhriogáid san Arm

source: The 1st Brigade is responsible for military operations in the southern region of the country and has its headquarters in Collins Barracks, Cork
ga: Is í an 1ú Briogáid a bhíonn freagrach as oibríochtaí míleata i réigiún theas na tíre, agus a ceanncheathrú aici i mBeairic Uí Choileáin, Corcaigh

source: The 2nd Brigade is responsible for military operations in the northern region and has its headquarters in Cathal Brugha Barracks, Dublin
ga: Is í an 2ú Briogáid a bhíonn freagrach as oibríochtaí míleata sa réigiún thuaidh, agus a ceanncheathrú aici i mBeairic Chathail Bhrugha, Baile Átha Cliath

source: There is also a Defence Forces Training Centre located in the Curragh Camp, Kildare
ga: Tá Ionad Oiliúna d’Óglaigh na hÉireann suite i gCampa an Churraigh, Cill Dara

source: You can find more information on the Army on the Defence Forces website
ga: Is féidir leat teacht ar a thuilleadh eolais i leith an Airm ar láithreán gréasáin Óglaigh na hÉireann

source: The Air Corps is the air component of the Defence Forces and has about 750 personnel
ga: Is é an tAerchór an chuid aerga d’Óglaigh na hÉireann, agus timpeall 750 pearsanra ann

source: It is based at Casement Aerodrome, Baldonnel, Dublin
ga: Is in Aeradróm Mhic Easmainn, Baile Dhónaill, Baile Átha Cliath atá sé bunaithe

source: Among other roles, the Air Corp operates the Ministerial Air Transport Service which provides air transport for the President and the Government
ga: I measc ról eile, is é an tAerchór a oibríonn an tSeirbhís Aeriompair Aireachta lena soláthraítear aeriompar don Uachtarán agus don Rialtas

source: You can find more information on the Air Corps on the Defence Forces website
ga: Is féidir leat teacht ar a thuilleadh eolais i leith Aerchóir ar láithreán gréasáin Óglaigh na hÉireann

source: The Naval Service is based on Haulbowline Island, Cork and its maximum strength is 1,144 personnel
ga: Is in Inis Sionnach, Corcaigh atá.an tSeirbhís Chabhlaigh bunaithe, agus is é 1,144 pearsanra an líon uasta aici

source: Among its other duties it provides the primary diving team in the State
ga: I measc a dualgas eile is amhlaidh a sholáthraíonn sí an phríomhfhoireann tumadóireachta sa Stát

source: You can find more information on the Naval Service on the Defence Forces website
ga: Is féidir leat teacht ar a thuilleadh eolais i leith na Seirbhíse Cabhlaigh ar láithreán gréasáin Óglaigh na hÉireann

source: The Reserve Defence Force is a part-time volunteer force of about 4,000 personnel
ga: Is fórsa saorálach le pearsanra tuairim 4,000 duine ann iad na hÓglaigh Chúltaca

source: It consists of the First Line Reserve, the Army Reserve and the Naval Service Reserve
ga: Is iontu a fhaightear an Cúltaca Céad Líne, Cúltaca an Airm agus Cúltaca na Seirbhíse Cabhlaigh

source: The First Line Reserve is comprised of former members of the Permanent Defence Force
ga: Is iad iarbhaill na mBuan-Óglach a fhaightear sa Chúltaca Céad Líne

source: You can find more information on the Reserve Defence Force on the Defence Forces website
ga: Is féidir leat teacht ar a thuilleadh eolais i leith na nÓglach Cúltaca ar láithreán gréasáin Óglaigh na hÉireann

source: For information on recruitment, contact the Defence Forces Recruitment Section in Defence Forces Headquarters
ga: Le haghaidh eolais i leith na hearcaíochta, déan teagmháil le Rannóg Earcaíochta Óglaigh na hÉireann i gCeanncheathrú Óglaigh na hÉireann
